
//征信授权书
import './index.less'
import React, { Component } from 'react'
import PropTypes from 'prop-types'
import { Link,withRouter } from 'react-router-dom'

@withRouter
export default class App extends Component {
	constructor (props, context) {
		document.title = "征信授权书"; 
		super(props, context)
		this.state = {      
		};
	}

	render () {
		return (
		<div className='view-wallet_agreement'>
			<div className="box">
				<h2 class="titles">今借到平台用户个人征信授权书</h2>
				<div>
					为了保障您的合法权益，您应当阅读并遵守本授权书，请您务必审慎阅读、充分理解本授权书条款内容，特别是免除或者减轻今借到平台或北京人人信科技有限公司（以下简称为“被授权人”或“人人信”）责任，或限制您权利的条款，其中免除或者减轻责任条款可能以加粗形式提示您注意。 除非您已阅读并接受本授权书所有条款，否则您无权使用今借到平台服务。您的使用、登录等行为即视为您已阅读并同意本授权书条款的约束。
				</div>
				<div>北京人人信科技有限公司：</div>
				<div>本人充分理解并同意，今借到平台服务是人人信为本人提供的借贷服务，现本人主动申请开通此项服务，为客观、准确地评估本人的信用等级和授信额度，并为本人提供优质地服务，就使用本人的相关必要信息，本人同意并授权如下。</div>
				<h4>
					一、本人同意并不可撤销地授权：人人信按照国家相关规定采集符合法律法规规定的本人个人信息及包括信贷信息在内的信用信息（含本人在今借到平台上办理业务时产生的不良信息），并可以向中国人民银行金融信用信息基础数据库、其他依法设立的征信机构提供以上信息。</h4>
				<h4>
					二、本人同意并不可撤销地授权：人人信可以根据国家有关规定，通过中国人民银行金融信用信息基础数据库、其他依法设立的征信机构、公安部公民身份信息数据库、移动运营商、京东网、学信网等机构查询、打印、保存符合法律法规规定的本人个人信息和包括信贷信息在内的信用信息。用途如下：</h4>
				<div>
					（一）审核本人贷款、借款或担保申请；
				</div>
				<div>
					（二）处理贷后管理事务；
				</div>
				<div>
					（三）处理本人征信异议；
				</div>
				<div>
					（四）依法或经有权部门要求；
				</div>
				<div>
					（五）其他本人向贵司申请或办理的业务。
				</div>
				<div>
					人人信将不时调整、增加用来调查本人资信的第三方机构，本人均不可撤销地予以同意。
				</div>
				<section>
					<h4>
						三、本人同意并授权，人人信可使用和分析本人在今借到平台中的相关历史信息、支付数据信息；本人同意并授权人人信将相关信息分析结果传输给借贷关系相关人（包括但不限于出借人、借款人、担保人），以便该借贷关系相关人评估其信用。为使人人信能按上述约定操作，本人也同意并授权，移动运营商、京东网、学信网等机构可将本人在使用电话、京东购物及接受教育过程中产生的相关必要信息提供给人人信使用并分析。人人信将不时调整、增加用来调查本人资信的第三方机构，本人均不可撤销地预先授权该等第三方机构满足人人信的需要。</h4>
				</section>
				<section>
					<h4>四、本人同意并授权，为便于出借人给本人发放借款或追索还款，人人信可以将本人的姓名、身份证号、联系方式、银行卡信息及其他相关必要信息传输给出借人使用。
					</h4>
				</section>
				<section>
					<h4>五、本人同意并授权，在本人逾期还款时，人人信可将本人的其他联系方式和联系地址等信息传输给出借人作催收所用。</h4>
				</section>
				<section>
					<h4>六、本人同意并授权，人人信提供本人以上信息给借款关系相关方、借款关系相关方使用和分析本人以上信息，将严格保护本人的隐私，同时并未违反人人信与本人之间的相关保密义务，且人人信和其他相关方应免予承担任何违约责任或赔偿责任。
				</h4>
				</section>
				<section>
					<h4>
						七、为偿还借款的目的，本人同意并授权人人信指定的第三方支付机构直接从本人的支付账户中（指本人申请、使用贷款服务，提供给人人信的银行账户），将相应款项划扣至人人信账户，用于偿还本人在出借人处全部债务直至清偿完毕。本人承诺前述交易委托指令视同本人作出。
					</h4>
				</section>
				<section>
					<h4>八、本人授权人人信采集的信息、本人享受今借到平台服务产生的信息，为便于向本人提供更加优质的服务和产品，本人授权人人信可以将前述信息分享给必要的合作伙伴。
					</h4>
				</section>
				<section>
					<h4>
						九、为了健全、完善本人的信用状况，提高服务质量，保护本人的合法权益，在使用今借到平台提供的服务时，本人授权信息提供者（指合法持有本人的用户信息并依法向人人信提供本人的用户信息的主体，目前包括中国人民银行金融信用信息基础数据库、其他依法设立的征信机构、公安部公民身份信息数据库、移动运营商、京东网、学信网等）向人人信提供本人的用户信息（指本人在使信息提供者提供的产品和服务整个过程中，由信息提供者采集、整理、保存、加工的本人的个人资料以及在此过程中产生的各种数据）；授权人人信可向信息提供者采集本人的用户信息，对其进行整理、保存、加工，并用于征信业务。
					</h4>
				</section>
				<section>
					<h4>
						十、为了本人能够及时、便利地使用今借到平台提供的各项服务，本人在确认前述授权的基础上，进一步授权信息提供者可在不另行获得本人专门授权的前提下，可随时将本人的用户信息的任何补充、更新与修改内容直接提供给人人信；进一步授权人人信可在不另行获得本人专门授权的前提下，随时直接向信息提供者采集本人的用户信息的任何补充、更新与修改内容。人人信可对其进行整理、保存、加工后用于征信业务，提供给本人或经本人授权的信息使用者使用。
					</h4>
				</section>
				<section>
					<h4>
						十一、本人同意并授权信息提供者及人人信采集本人的支付账户、有价证券等数额信息。本人亦在此确认：在同意信息提供者及人人信采集本条约定信息之前，本人已经理解并知悉提供该等信息可能会对本人产生的不利后果（例如，第三方通过此信息对本人的财产状况进行判断，可能对本人作出负面性评价）。本人同意并授权信息提供者可向人人信提供本人的个人不良信息，同时，人人信可向信息提供者采集本人的个人不良信息。如果本人需要对上述不良信息作出说明，本人应及时联系人人信，人人信征信数据库将予以记载。</h4>
				</section>
				<section>
					<h4>
						十二、人人信不会采集本人的宗教信仰、基因、指纹、血型、疾病和病史信息以及法律、行政法规规定禁止采集的其他本人的个人信息。
					</h4>
				</section>
				<section>
					<h4>
						十三、本人同意人人信不应对其从信息提供者处获取的本人的用户信息的真实性、合法性和完整性承担法律责任；该等责任（如有）概由本人自行承担。
					</h4>
				</section>
				<section>
					<h4>
						十四、本人可另行通过书面通知或其他合法方式授权人人信将本人的用户信息等信用状况提供、披露给本人指定的信息使用者，该等通知、指示或授权应包含其查询本人的用户信息的用途等内容。本人理解并同意，本人在本条项下的授权并不表示人人信向本人负有依据本人的指示向任何合法主体进行披露的义务，人人信有权自行决定是否按本人的指示将本人的用户信息披露给本人所指定的信息使用者。
					</h4>
				</section>
				<section>
					<h4>
						十五、人人信提供的征信服务仅供本人及借贷关系相关方参考，人人信对本人及相关方根据人人信所提供的服务作出的判断、决定以及所从事的活动等行为及其任何后果不承担任何法律责任。
					</h4>
				</section>
				<section>
					<h4>授权人声明：</h4>
					<div>
						本授权书是本人向人人信做出的单方承诺，效力具有独立性，不因《借款协议》的任何条款无效而失效。
					</div>
					<div>
						以上授权期限为本人作出本授权承诺之日起至本人在今借到平台上所有业务终结之日止。
					</div>
					<div>
						若本人与被授权人发生任何纠纷或争议，首先应友好协商解决；协商不成的，本人同意将纠纷或争议提交本授权书签订地（即中国北京市海淀区）有管辖权的人民法院管辖。本授权书的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。
					</div>
					<div>
						本人已知悉本授权书所有内容（特别是加粗字体内容）的意义以及由此产生的法律效力，自愿作出上述授权，本授权书是本人真实的意思表示，本人同意承担由此带来的一切法律后果。
					</div>
					<div>
						特此授权！
					</div>
				</section>
			</div>
		</div>
		)
	}
}
